show commands on Router R1-AGG1:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R5-MTC1:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R2-AGG2:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R3-CSG1:903        0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 4
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R5-MTC1:10                    10.250.88.5     Full       1    0       33
   0.0.0.0
to-R2-AGG2:10                    10.250.88.2     Full       1    0       38
   0.0.0.0
to-R3-CSG1:903                   10.250.88.3     Full       1    0       34
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 3
===============================================================================
show commands on Router R2-AGG2:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R6-MTC2:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R1-AGG1:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R4-CSG2:903        0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 4
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R6-MTC2:10                    10.250.88.6     Full       1    0       36
   0.0.0.0
to-R1-AGG1:10                    10.250.88.1     Full       1    0       36
   0.0.0.0
to-R4-CSG2:903                   10.250.88.4     Full       1    0       36
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 3
===============================================================================
show commands on Router R3-CSG1:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R1-AGG1:903        0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R4-CSG2:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 3
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R1-AGG1:903                   10.250.88.1     Full       1    0       38
   0.0.0.0
to-R4-CSG2:10                    10.250.88.4     Full       1    0       33
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 2
===============================================================================
show commands on Router R4-CSG2:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R2-AGG2:903        0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R3-CSG1:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 3
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R2-AGG2:903                   10.250.88.2     Full       1    0       40
   0.0.0.0
to-R3-CSG1:10                    10.250.88.3     Full       1    0       30
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 2
===============================================================================
show commands on Router R5-MTC1:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R6-MTC2:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R1-AGG1:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 3
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R6-MTC2:10                    10.250.88.6     Full       1    0       37
   0.0.0.0
to-R1-AGG1:10                    10.250.88.1     Full       1    0       32
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 2
===============================================================================
show commands on Router R6-MTC2:
show router ospf interface

===============================================================================
Rtr Base OSPFv2 Instance 0 Interfaces
===============================================================================
If Name               Area Id         Designated Rtr  Bkup Desig Rtr  Adm  Oper
-------------------------------------------------------------------------------
system                0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R5-MTC1:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
to-R2-AGG2:10         0.0.0.0         0.0.0.0         0.0.0.0         Up   PToP
-------------------------------------------------------------------------------
No. of OSPF Interfaces: 3
===============================================================================
show router ospf neighbor

===============================================================================
Rtr Base OSPFv2 Instance 0 Neighbors
===============================================================================
Interface-Name                   Rtr Id          State      Pri  RetxQ   TTL
   Area-Id
-------------------------------------------------------------------------------
to-R5-MTC1:10                    10.250.88.5     Full       1    0       35
   0.0.0.0
to-R2-AGG2:10                    10.250.88.2     Full       1    0       35
   0.0.0.0
-------------------------------------------------------------------------------
No. of Neighbors: 2
===============================================================================
